Была создана база, занимающая 6.4Gb места, имеющая 768 файлов по 8.4мб каждый. Размер каждой записи составил 200кб

Рассмотрим GET запросы
Заметим, что когда мы рассматриваем лучшие случаи - кешируем один и тот же файл снова и снова, база показывает результаты
в десятки раз лучше, чем когда ключа нет. Оно и понятно, когда ключа в базе нет, или когда ключ запрашивается один и тот же,
происходит кеширование файла в котором находится ключ, что позволяет в конечном счете его очень быстро и четко получать снова и снова
С другой стороны, когда ключа в базе нет, чтобы доказать этот факт базе приходится пройтись по всем файлам, начиная
с самого нового и заканчивая самым старым. Это занимает много времени от того и видим критическое падение производительности

Теперь поговорим про PUT запросы
Заметим, что лучший случай и худший случай работают очень быстро, на уровне лучшего случая GET запроса по скорости
и не особо отличаются даже друг от друга по производительности. Это связано с тем, что худший случай лишь заставляет нас
асинхронно переходить к записи новых файлов на диск, отсюда и небольшая потеря в производительности, когда как в лучшем
случае происходит перезапись одного и того же ключа в InMemory хранилище.

Это все позволяет нам сделать вывод, что LSM дерево действительно очень хорошо подходит для быстрой записи новых данных,
даже если мы записываем абсолютно разные ключи и значения, однако очень плохо подходит для быстрого чтения данных,
особенно учитывая, что в реальной жизни ключи скорее всего будут всегда разные, а так же будет много запросов на несуществующие ключи.